tutorials/mixerVessel2DpumpMRF-1.5-dev/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="MRFSimpleFoam"

./makeMesh
runApplication $application
